Revit 2026 API

# RailTypeDefaultJoinOption Enumeration

---

The default join type of the rail.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RailTypeDefaultJoinOption
```
```vb
Public Enumeration RailTypeDefaultJoinOption
```
```cpp
public enum class RailTypeDefaultJoinOption
```
```fsharp
type RailTypeDefaultJoinOption
```

| Member name | Value | Description |
| --- | --- | --- |
| Fillet | 1 | The rails will be joined by a fillet connection. |
| Miter | 0 | The rails will be joined by a miter connection. |

#### Reference

Autodesk.Revit.DB.Architecture Namespace